app/workers/hard_worker.rb

  def perform movie
    case movie
    when MAIL_MONTH
      Movie.all.each do |movie|
---
SELECT "movies".* FROM "movies"