app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres"
SELECT "movies".* FROM "movies" WHERE "movies"."genre_id" = ?  [["genre_id", 1]]
---
  def index
    @genres = Genre.all
    @movies = Movie.all

SELECT "movies".* FROM "movies" WHERE "movies"."genre_id" = ?  [["genre_id", 1]]
---
  def show
    @movies = Movie.all

SELECT "movies".* FROM "movies" WHERE "movies"."genre_id" = ?  [["genre_id", 2]]
---
  def update_movie_list

    if params[:genre_id].present?
      @movies = Movie.where(genre_id: params[:genre_id]).group(:name)

SELECT "movies".* FROM "movies" WHERE (name IN ('demo_1') OR release_date IN (NULL) OR director IN (NULL) OR summary LIKE '%%')
SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies" WHERE (name IN ('abc_1') OR release_date IN (NULL) OR director IN (NULL) OR name LIKE '%%')
---
  def search_movie_lists
    if params[:list_search].present?
      @searchs = Movie.where("name IN (?) OR release_date IN (?) OR director IN (?) OR summary LIKE ?", params[:list_movie], params[:list_year], params[:list_keyword], "%#{params[:list_search]}%").uniq
    elsif  params[:list_movie].present? || params[:list_year].present? || params[:list_keyword].present
      @searchs = Movie.where("name IN (?) OR release_date IN (?) OR director IN (?)", params[:list_movie], params[:list_year], params[:list_keyword]).uniq

SELECT "movies".* FROM "movies" WHERE (summary LIKE '%%') GROUP BY "movies"."summary" ORDER BY "movies"."summary" ASC
---
  def autocomplete_movie_summary
    movies = Movie.where('summary LIKE ?', "%#{params[:search_summary_movie]}%").group(:summary).order(:summary).all
    render :json => movies.map { |movie| {:id => movie.id, :label => movie.summary, :value => movie.summary} }

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_params
    @genre = Genre.find(params[:id])