app/controllers/movies_controller.rb

  def new
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def create
    @movie = Movie.new(movie_params)
    @movie.user_id = current_user.id

    if @movie.save!
      MovieMailer.with(movie: @movie).new_movie_email.deliver_later
---
INSERT INTO "movies" ("genre_id", "name", "director", "star", "release_date", "summary", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "movies".* FROM "movies"

  def edit
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def update
    @movie.update(movie_params)
---
UPDATE "movies" SET "name" = ?, "genre_id" = ?, "director" = ?, "star" = ?, "release_date" = ?, "summary" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["name", "tom and jery"], ["genre_id", 1], ["director", "hollywood"], ["star", "5"], ["release_date", "2020-07-24"], ["summary", "fsvsb"], ["updated_at", "2020-07-24 02:28:25.920593"], ["id", 12]]

  def set_params
    @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]