app/controllers/movies_controller.rb

  def index

    if current_user.present?
      @movies = current_user.movies.paginate(page: params[:page], per_page: 5)
---
SELECT "movies".* FROM "movies" WHERE "movies"."user_id" = ?  [["user_id", 1]]